In [1]:
import pandas as pd

## Series

In [2]:
data_list = [1, 2, 3, 4, 5]

In [4]:
type(data_list)

list

In [5]:
data_list

[1, 2, 3, 4, 5]

In [6]:
# create a series from a list
data_serie = pd.Series(data_list)

In [7]:
type(data_serie)

pandas.core.series.Series

In [8]:
data_serie

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [27]:
# create a series from a list seting index from a index_name_list
index_name_list = ["Line#"+str(i) for i in data_list]
data_serie = pd.Series(data=data_list, index=index_name_list) 
data_serie

Line#1    1
Line#2    2
Line#3    3
Line#4    4
Line#5    5
dtype: int64

In [29]:
# create a series from a dictionary
data_dictionary = {"Line#"+str(i) : i for i in data_list}
data_serie = pd.Series(data_dictionary)
data_serie

Line#1    1
Line#2    2
Line#3    3
Line#4    4
Line#5    5
dtype: int64

In [33]:
# sum series values with same index names
serie1 = data_serie
serie2 = data_serie + 1 # it sums 1 in the value
serieSum = serie1 + serie2 # it sums both series based on index name
serieSum

Line#1     3
Line#2     5
Line#3     7
Line#4     9
Line#5    11
dtype: int64

## data frames

In [41]:
column_names = ["name", "age", "high"]
canada = [
    ("sylvio", 28, 182),
    ("jessica", 27, 162)
]
df1 = pd.DataFrame(data = canada, columns=column_names)
df1

      name  age  high
0   sylvio   28   182
1  jessica   27   162

In [43]:
brazil = [
    ("pai", 50, 180),
    ("mae", 50, 160),
]
df2 = pd.DataFrame(data = brazil, columns=column_names)
df2

  name  age  high
0  pai   50   180
1  mae   50   160

In [45]:
# concatenate data frames
df = pd.concat([df1, df2])
df

      name  age  high
0   sylvio   28   182
1  jessica   27   162
0      pai   50   180
1      mae   50   160